[
    {
        "Название": "Devhands Open Sessions c Владимиром Перепелицей. Очереди в 2025м что выбрать Kafka RabbitMQ NATS или что-то ещё?",
        "Описание": "Привет, Хабр! На прошлой неделе мы провели стрим по очередям с Владимиром Перепелицей (эксперт по большим проектам, очередям и Tarantool, Solution Architect в Exness, создатель S3 в VK Cloud, регулярный спикер и член ПК конференций Highload). Обсудили выбор брокера или системы очередей 2025м году: что поменялось? NATS, его особенности, перспективы, кого он “подвинет” в первую очередь - Kafka или RabbitMQ? Что нового в свежей Apache Kafka 4? Насколько популярны архитектуры, где, например, Kafka основной storage (IoT, сбор метрик и тд). Под катом - расшифровка стрима.",
        "Ссылка": "https://habr.com/ru/articles/899670/",
        "Изображение": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/eec/715/0b5/eec7150b553c0b7b9cc66739a1794c08.png"
    },
    {
        "Название": "Рефакторинг в BI-проектах когда и зачем переписывать «рабочий» код",
        "Описание": "В крупных федеральных организациях всё активнее используется подход управления на основе данных, который требует активного использования и постоянной переделки, развития, модификации аналитических приложений, отчётов, данных. Тот опыт и наши наработки, которыми мы хотим поделиться в рамках данной статьи, приносят пользу на многих проектах, где речь идёт о сотнях аналитических отчётов и дэшбордов, нескольких тысячах показателей и сотнях и тысячах активных пользователей, где, самое главное, вендорские решения кастомизируются внутренними командами заказчика. Для таких случаев всё, о чём мы расскажем дальше, очень важно, для остальных — надеемся, что будут полезны отдельные мысли и технические решения.",
        "Ссылка": "https://habr.com/ru/companies/luxms_bi/articles/899664/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/7ef/2a6/46b/7ef2a646b3bb6a326cc244ca787d5148.jpg"
    },
    {
        "Название": "Рефакторинг в BI-проектах когда и зачем переписывать «рабочий» код",
        "Описание": "В крупных федеральных организациях всё активнее используется подход управления на основе данных, который требует активного использования и постоянной переделки, развития, модификации аналитических приложений, отчётов, данных. Тот опыт и наши наработки, которыми мы хотим поделиться в рамках данной статьи, приносят пользу на многих проектах, где речь идёт о сотнях аналитических отчётов и дэшбордов, нескольких тысячах показателей и сотнях и тысячах активных пользователей, где, самое главное, вендорские решения кастомизируются внутренними командами заказчика. Для таких случаев всё, о чём мы расскажем дальше, очень важно, для остальных — надеемся, что будут полезны отдельные мысли и технические решения.",
        "Ссылка": "https://habr.com/ru/companies/luxms_bi/articles/899662/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/7ef/2a6/46b/7ef2a646b3bb6a326cc244ca787d5148.jpg"
    },
    {
        "Название": "12 событий апреля которые нельзя пропустить",
        "Описание": "Мы собрали для вас серию открытых уроков, которые пройдут в апреле и помогут не просто разобраться в сложных темах, а применить знания на практике. Будущее AI агентов на основе LLM, Prometheus для мониторинга, как избежать хаоса в IT-проектах и как обучить модель понимать языки — на эти и не только темы поговорим с экспертами в IT. Рассмотрим реальные кейсы, обсудим опыт и получим понимание того, как внедрять эти технологии в проекты.",
        "Ссылка": "https://habr.com/ru/companies/otus/articles/899644/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/95a/292/9c9/95a2929c90642dd516d86cc1d3595a70.jpg"
    },
    {
        "Название": "Как я стал core-разработчиком Python в 19 лет",
        "Описание": "Как я стал core-разработчиком CPython в 19 лет: История усилий и достижений",
        "Ссылка": "https://habr.com/ru/articles/899636/",
        "Изображение": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/54a/c8a/02c/54ac8a02cca2ae1c4db50b0944864ad3.png"
    },
    {
        "Название": "KotlinJS в GitHub Actions",
        "Описание": "GitHub Actions (GHA) — отличный инструмент для настройки CI/CD, а в GitHub Marketplace можно найти тысячи готовых GHA под любые задачи. Но всегда же найдётся процесс, который захочется настроить под себя. Тогда нам придётся написать кастомный GHA.",
        "Ссылка": "https://habr.com/ru/companies/dododev/articles/898704/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/a05/16c/4fd/a0516c4fd8ccf65311cef91d48e10e18.jpg"
    },
    {
        "Название": "Инженерный софт для швейного производства",
        "Описание": "Современная промышленность давно и активно использует информационные технологии. Мы редко задумываемся, что не только окружающие нас смартфоны и компьютеры являются их продуктом. Одеваясь по утрам, мы тоже пользуемся вещами, созданными с помощью современного хайтека.",
        "Ссылка": "https://habr.com/ru/companies/lure_it/articles/899626/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/25b/d32/7d9/25bd327d94e0b1daf32904f8dfe370c2.jpg"
    },
    {
        "Название": "Зачем моему бизнесу нейросети гайд для не-программистов",
        "Описание": "Как мне применить нейросети в своем бизнесе?",
        "Ссылка": "https://habr.com/ru/articles/899610/",
        "Изображение": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/899/6c9/6c7/8996c96c7c6d5120c9ec2a028aa6bc4f.png"
    },
    {
        "Название": "Путь видео в онлайн-кинотеатрах от «стекла до стекла». Middleware — ядро подписки сервисы витрина",
        "Описание": "Привет, Хабр! Снова с вами Дмитрий Новожилов — техлид онлайн-кинотеатра KION. В прошлый раз я рассказал, откуда берется контент на киносервисах и как он обрабатывается. Для этого разобрал источники данных и элемент Headend, включающий пункт приема сигнала, кодер и пакетайзер.",
        "Ссылка": "https://habr.com/ru/companies/ru_mts/articles/898642/",
        "Изображение": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/19d/ea5/e2a/19dea5e2a9d5e04018617d961ec07edf.png"
    },
    {
        "Название": "Декларативный API деревья поведений и реконсиляция как мы в MWS строим сервис Compute",
        "Описание": "Приветствую всех! На связи Родион Цалкин, Tech Product IaaS в MWS.",
        "Ссылка": "https://habr.com/ru/companies/mws/articles/899288/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/96a/192/fd8/96a192fd8f236f67f199e48b0e07d5b9.jpg"
    },
    {
        "Название": "Путь в микроэлектронику через верификацию руководство для начинающих",
        "Описание": "Привет, Хабр! Меня зовут Дмитрий Кишко, я руководитель группы функциональной верификации в YADRO. Представьте, что вы строите космический корабль. Он еще не взлетел, но любая ошибка в конструкции уже может стоить миллионы или даже сорвать всю миссию. В разработке микроэлектроники ситуация похожа: перед тем как чип попадет на производство, его работу проверяют сотни раз, но не физически, а в симуляторах. Этот этап называется функциональной верификацией, и без него современная электроника просто «не взлетит».",
        "Ссылка": "https://habr.com/ru/companies/yadro/articles/899446/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/cbf/b23/d09/cbfb23d090c4b6dd5a7f3613a328ea51.jpeg"
    },
    {
        "Название": "High Availability в Postgres Pro без головной боли",
        "Описание": "Для тех, кто устал от «зоопарка» решений по созданию отказоустойчивых кластеров, расскажем, как добиться нужной функциональности одним решением. BiHA позволяет данным «выжить», даже если один из ЦОДов был физически уничтожен. Как же мы этого добились?",
        "Ссылка": "https://habr.com/ru/companies/postgrespro/articles/898396/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/377/683/ab8/377683ab881ecb769a8c819c9a9614e8.jpg"
    },
    {
        "Название": "Open source в Яндексе — рассказывает Сергей Бережной директор по devrel и евангелист открытой разработки",
        "Описание": "На связи «Open source в России» [серия «бигтехи»], и мы продолжаем говорить о развитии организаций на базе открытой разработки. На днях я написал @veged с предложением обсудить open source-проекты Яндекса и все, что с ними связано в компании. Сергей поделился историческими подробностями, рассказал о работе с сообществом и в целом об отношении к open source в Яндексе. В итоге у нас получился один из наиболее подробных материалов из всей серии интервью.",
        "Ссылка": "https://habr.com/ru/articles/899376/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/367/dd4/409/367dd4409b74eecbb5b8b3c1577b5e9c.jpg"
    },
    {
        "Название": "Pairwise тестирование. Почему зачем и как?",
        "Описание": "Всем привет! Попарное тестирование (pairwise testing) - одна из самых распространённых техник тест дизайна. Уверена, вы уже про неё читали в книгах, сертификациях, статьях…",
        "Ссылка": "https://habr.com/ru/articles/876580/",
        "Изображение": "https://habrastorage.org/r/w780/getpro/habr/upload_files/be7/34b/f58/be734bf58f12112ce73fa48206430958.jpg"
    },
    {
        "Название": "Путь инженера-программиста от джуна до сеньора",
        "Описание": "За всю свою работу инженером-программистом в области разработки встраиваемых систем, а это более 15 лет, мне ни разу не приходила в голову идея спросить у своего руководителя о том, что мне нужно сделать для того, чтобы перейти с одной категории на другую. Всё что я делал, это решал поставленные перед мной задачи разного характера. Интерес был именно в решении задач, а не в получении категорий. Категории как-то сами по себе назначались…",
        "Ссылка": "https://habr.com/ru/articles/899532/",
        "Изображение": "https://habrastorage.org/r/w1560/getpro/habr/upload_files/e7c/97d/467/e7c97d46736d9df2086f681d93b652f4.png"
    }
]